UNF_KlK.КИТ_ДОК/src/Catalogs/Пакеты/Пакеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пакеты</name>
  <attributes>
    <name>ДатаПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.Стандарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Толщина</name>
    <type>
      <types>CatalogRef.Толщины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>CatalogRef.Ширины</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДосок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Учетчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПакета</name>
    <type>
      <types>EnumRef.ВидыПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Несертифицированный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

UNF_KlK.КИТ_ДОК/src/Enums/ВидыРеквизита/ВидыРеквизита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРеквизита</name>
  <enumValues>
    <name>ПФ</name>
  </enumValues>
  <enumValues>
    <name>ГП</name>
  </enumValues>
</mdclass:Enum>

UNF_KlK.КИТ_ДОК/src/Catalogs/Пакеты/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СерияОбъект = ТекущийОбъект.СерияНоменклатуры.ПолучитьОбъект();
	СерияОбъект.Наименование = ТекущийОбъект.Код;
	СерияОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьКод(ТекущийОбъект,ПорядковыйНомер) 
//	СтруктураДанных = Новый Структура;
//	
//	СтруктураДанных = ТовароведУправляемая.ВычислитьНомерПакета(ТекущийОбъект.Смена,ТекущийОбъект.Подразделение,ТекущийОбъект.ДатаПакета);
//	ПорядковыйНомер = СтруктураДанных.ПорядковыйНомер;
//    ТекущийОбъект.Код = СтруктураДанных.КодПакета;	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаПакетаПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер);	
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	ВычислитьКод(Объект,ПорядковыйНомер);
КонецПроцедуры                                             

&НаКлиенте
Процедура КоличествоДосокПриИзменении(Элемент)
	Объект.Объем = КИТ_РаботаСДаннымиКлиент.РасчетОбъемаДосок(Объект.КоличествоДосок,Объект.Толщина,Объект.Ширина,Объект.Длина);	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 	
	ТекущийОбъект.Номенклатура = ТекущийОбъект.Стандарт.Номенклатура;
	ТекущийОбъект.ХарактеристикаНоменклатуры = КИТ_РаботаСДаннымиСервер.ПолучениеХарактерстикиПиломатериалов(ТекущийОбъект.Стандарт.Порода,ТекущийОбъект.Толщина,ТекущийОбъект.Ширина,ТекущийОбъект.Стандарт.Сорт,ТекущийОбъект.Длина,ТекущийОбъект.Влажность,ТекущийОбъект.Номенклатура,Отказ);
	ТекущийОбъект.СерияНоменклатуры = КИТ_РаботаСДаннымиСервер.НайтиСериюНоменклатуры(ТекущийОбъект.Код,ТекущийОбъект.Номенклатура);
   	ТекущийОбъект.Наименование = ТекущийОбъект.Код+";"+ТекущийОбъект.Номенклатура+";"+ТекущийОбъект.ХарактеристикаНоменклатуры+";"+ТекущийОбъект.ДатаПакета;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
//	Если ПорядковыйНомер > СтарыйНомер Тогда
//		ТовароведУправляемая.ЗаписатьДанныеВРегистрНомераПакетов(Объект.Смена,Объект.Подразделение,ПорядковыйНомер);
//	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПВХ_Влажность = Константы.СвойствоДляВлажности.Получить();
	ВидДляПараметров = Перечисления.ВидыРеквизита.ГП;

	Если Параметры.Ключ.Пустая() Тогда

		Объект.Наименование = "№";
		Объект.Учетчик = Пользователи.ТекущийПользователь();
		Объект.ДатаПакета = ТекущаяДата();

	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	

КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
